app/Controllers/FrontendController.php

    public function index()
    {
        $model = new CarouselModel();
        $data['images'] = $model->where('estado', 'activo')->findAll();
---
SELECT *
FROM `carousel`
WHERE `estado` = 'activo'